import re

pre_resubs = [
    [re.compile('([^्])[\u200c\u200d]'),'\\1'],
    [re.compile('विद्याथ्र्ा'),'विद्यार्थी'],
    [re.compile('(.)र्ा'),'र्\\1ा'],
]
    
subs = [
        ['्ा', ''],
        ['््', '्'],
        ['ेे', 'े'],
        ['ैै', 'ै'],
        ['ेै', 'ै'],
        ['ैे', 'ै'],
        ['ाे', 'ो'],
        ['ेा', 'ो'],
        ['ाै', 'ौ'],
        ['ैा', 'ौ'],
        ['अा', 'आ'],
        ['अाे', 'ओ'],
        ['अो', 'औ'],
        ['अाै', 'औ'],
        ['अौ', 'औ'],
        ['एे', 'ऐ'],
        ['र्इृ', 'ई'],
        ['र्इ', 'ई'],
        ['ँु', 'ुँ'],
        ['ँू', 'ूँ'],
        ['¥', 'ऱ्'],
        ['े«', '्रे'],
        ['Þ', ''],
        # ['«े', '्रे'],प्रंmेन्डस
        # ['«ो', '्रो'],
        # ['«ा', '्रा'],
        ['«', '्र'],
        ['Ô', 'क्ष'],
        ['Ï', 'फ्'],
        ['¤', 'त्'],
        ['ì', 'त्'],
        ['ı', 'द्र'],
        ['È', 'ष'],
        ['Ç', 'फ्'],
        ['¢', 'ग'],
        ['ˆ', 'फ्'],        
        ['º', 'फ्'],
        ['Œ', 'त्'],
        ['œ', 'त्र्'],
        ['ø', 'रू'],
        ['·', 'ङ्ग'],
        ['¨', 'ङ्ग'],
        ['⋲', 'ह्'],
        ['≈', 'ह्'],
        ['प्रm', 'फ्र'],
        ['प|m', 'फ्र'],
        # ['पm', 'फ'],
        # ['पैm', 'फै'],
        ['वm', 'क'],
        ['धm', 'झ'],
        ['भm', 'झ'],
        ['तm', 'क्त'],
        ['उm', 'ऊ'],
        ['उ“m', 'ऊँ'],
        ['हरm', 'हरू'],
        ['व्रm', 'क्र'],
        ['त्रm', 'क्र'],
        ['त्र्रm', 'क्र'],
        # ['बm', 'ब'],
        # ['झm', 'झ'],
        ]
post_resubs = [
    [re.compile('प(\S?)m'), 'फ\\1'],
    [re.compile('([^अ-ौ])ं'), '\\1'],
    [re.compile('([फबझसखन])m'), '\\1'],
    [re.compile('([\u0905-\u094c])“'), '\\1ँ'],
    [re.compile('([ू])ा'), '\\1ँ']
]

catch_all = re.compile('[\u0000-\u0009\u000b-\u001f\u007f-\u08ff\u0980-\u200b\u200e-\uffff]') #

def cleanup(input: str) -> str: 

    for rs in pre_resubs:
        input = rs[0].sub(rs[1], input)
    for s in subs:
        input = input.replace(s[0], s[1])
    for rs in post_resubs:
        input = rs[0].sub(rs[1], input)

    return catch_all.sub(' ', input)
