#!/bin/python

dev_chars = ''.join([
'अ','आ','इ','ई','उ','ऊ','ऋ','ॠ','ऌ','ॡ','ए','ऐ','ओ','औ',
'क','ख','ग','घ','ङ',
'च','छ','ज','झ','ञ',
'ट','ठ','ड','ढ','ण',
'त','थ','द','ध','न',
'प','फ','ब','भ','म',
'य','र','ल','व',
'श','ष','स','ह',
'ा','ि','ी','ु','ू','ृ','े','ै','ो','ौ','्','ँ','ं','ः','़','ॐ','।','॥',
'०','१','२','३','४','५','६','७','८','९' ])

newa_chars = ''.join([
'𑐀','𑐁','𑐂','𑐃','𑐄','𑐅','𑐆','𑐇','𑐈','𑐉','𑐊','𑐋','𑐌','𑐍',
'𑐎','𑐏','𑐐','𑐑','𑐒',
'𑐔','𑐕','𑐖','𑐗','𑐘',
'𑐚','𑐛','𑐜','𑐝','𑐞',
'𑐟','𑐠','𑐡','𑐢','𑐣',
'𑐥','𑐦','𑐧','𑐨','𑐩',
'𑐫','𑐬','𑐮','𑐰',
'𑐱','𑐲','𑐳','𑐴',
'𑐵','𑐶','𑐷','𑐸','𑐹','𑐺','𑐾','𑐿','𑑀','𑑁','𑑂','𑑃','𑑄','𑑅','𑑆','𑑉','𑑋','𑑌',
'𑑐','𑑑','𑑒','𑑓','𑑔','𑑕','𑑖','𑑗','𑑘','𑑙' ])

#'ङ्ह','ञ्ह','न्ह','म्ह','र्ह','ल्ह'
#'𑐓','𑐙','𑐤','𑐪','𑐭','𑐯'
def convert_dev_newa(input: str) -> str:
    """ Convert string with Devanagari unicode chars to Newa unicode characters
    
    Args:
        input : str
            input string with Devanagari characters - 0x0900-0x097F unicode range 

    Returns:
        A string with equivalent Newa unicode characters - 0x11400 
    """
    newa = input.translate(str.maketrans(dev_chars, newa_chars))

    return newa
